Статистика работы механизмов/Конфигурация/DataProcessors/_ПечатьЗаявленийВБК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ПечатьЗаявленийВБК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗаявления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ПечатьЗаявленийВБК/_ПечатьЗаявленийВБК/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьНаСервере()
	
	ЭтаФорма.СписокСчетовДУ.Очистить();
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект"); 	
	
	ДанныеДляЗаполнения = ОбъектНаСервере.ВыбратьДанныеДляЗаполнения();
	Если ДанныеДляЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ТаблицаДанных = ДанныеДляЗаполнения.Выгрузить();
	
	Для каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		
		НоваяСтрокаСчетаДУ = ЭтаФорма.СписокСчетовДУ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСчетаДУ, СтрокаТаблицыДанных);
			
		НоваяСтрокаСчетаДУ.Флажок = Истина;
		
	КонецЦикла;
			
КонецПроцедуры // ОбновитьНаСервере

&НаКлиенте
Процедура ИзменитьСостояниеФлажков(НовоеСостояние)
	
	Для каждого СтрокаСчетаДУ Из ЭтаФорма.СписокСчетовДУ Цикл
		СтрокаСчетаДУ.Флажок = НовоеСостояние;
	КонецЦикла;
	
КонецПроцедуры // ИзменитьСостояниеФлажков

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация   = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.ДатаЗаявления = ТекущаяДата();
	
	ЭтаФорма.ЮрЛицоОрганизации = Объект.Организация.ЮрФизЛицо;
		
	// Период пока берем от предыдущего рабочего дня по текущий день
	Объект.Период.ДатаНачала    = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ТекущаяДата()-86400);
	Объект.Период.ДатаОкончания = ТекущаяДата();
	Объект.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион");
	
	ШаблонЗаявления	 = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ЗаявлениеНаОткрытиеПортфелей");
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаУстановитьФлажки");
	Попытка
		ИзменитьСостояниеФлажков(Истина);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСнятьФлажки");
	Попытка
		ИзменитьСостояниеФлажков(Ложь);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновить");
	Попытка
		ОбновитьНаСервере();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЧтоКаталогСуществует(ПутьККаталогу, ПараметрыСессии = Неопределено)
	
	Файл = Новый Файл(ПутьККаталогу);
	
	Если Файл.Существует()
		и Файл.ЭтоКаталог() Тогда
		Возврат Истина;
	КонецЕсли;

	ДобавитьТекстОшибки(ПараметрыСессии, "Каталог """ + ПутьККаталогу + """ не найден");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Каталог """ + ПутьККаталогу + """ не найден",,"Объект.КаталогСохранения");
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура КомандаПечатьЗаявления(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПечатьЗаявления");
	Попытка
		ВыполнитьПечатьЗаявления(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПечатьЗаявления(ПараметрыСессии)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, "Не заполнены обязательные реквизиты");
		Возврат;
	КонецЕсли;
	
	Если СписокСчетовДУ.Количество() = 0 Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, "Список счетов ДУ пуст");
		Возврат;
	КонецЕсли;
	
	ОбщиеДанные = ПолучитьОбщиеРеквизитыДляПечати();
	МассивДокументов = ПолучитьСтруктуруДанных();
	
	Если МассивДокументов.Количество() = 0 Тогда
		Сообщить("Не выбраны данные для печати");
		ДобавитьТекстОшибки(ПараметрыСессии, "Не выбраны данные для печати");
		Возврат;
	КонецЕсли;
	
	КаталогСохранения = СокрЛП(Объект.КаталогСохранения);
	КаталогСохранения = СтрЗаменить(КаталогСохранения, "/", "\");	
	Если Прав(КаталогСохранения, 1) <> "\" Тогда
		Если Не ПроверитьЧтоКаталогСуществует(КаталогСохранения, ПараметрыСессии) Тогда
			ДобавитьТекстОшибки(ПараметрыСессии, "Каталог сохранения не найден");
			Возврат;
		КонецЕсли;
		КаталогСохранения = КаталогСохранения + "\";
	ИначеЕсли Не ПроверитьЧтоКаталогСуществует(Лев(КаталогСохранения, СтрДлина(КаталогСохранения) - 1), ПараметрыСессии) Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, "Каталог сохранения не найден");
		Возврат;
	КонецЕсли;
	
	ИмяФайлаШаблонаЗаявления = ПолучитьИмяВременногоФайла("docx");
	ШаблонЗаявления.Записать(ИмяФайлаШаблонаЗаявления);
	
	Отказ = Ложь;
	
	Попытка
		
		WordApp = Новый COMОбъект("Word.Application");
		WordApp.Application.Visible = Ложь;
		
		// Одно заявление и по одному файлу с информацией по каждому ДУ
		NewDoc = WordApp.Application.Documents.Add(ИмяФайлаШаблонаЗаявления, False, , Ложь);
			
		WordVars = NewDoc.Variables;
		Для Каждого Реквизит Из ОбщиеДанные Цикл
			WordVars.Item(Реквизит.Ключ).Value = Реквизит.Значение;					
		КонецЦикла;
		
		Для Каждого Реквизит Из МассивДокументов[0] Цикл
				WordVars.Item(Реквизит.Ключ).Value = Реквизит.Значение;
		КонецЦикла;
		
		// заполняем таблицу счетов ДУ в файле
		Колво_Строк = МассивДокументов.Количество();
	    Колво_Колонок = 2;
		WordTable = NewDoc.Tables(1);
		WordRows = WordTable.Rows;
			                          		
		Для Н = 1 По Колво_Строк-1 Цикл
			WordRows.Add();
		КонецЦикла;                               
									
		Н = 2; 
		Для Каждого ЭлементМассива Из МассивДокументов Цикл 
			
			InRow = WordRows.Item(Н);	
			Кол = 1;
			Для Каждого СтрокаСтруктуры Из ЭлементМассива Цикл
				
				Если Не (СтрокаСтруктуры.Ключ = "КодСчетаДУ" ИЛИ СтрокаСтруктуры.Ключ = "СерияНомерПаспорта") Тогда
					Продолжить;
				КонецЕсли;
				
				Если Колво_Колонок < Кол Тогда
					Продолжить;
				КонецЕсли;
				
				Знч = СтрокаСтруктуры.Значение;				
				Знч = СокрЛП(Знч);
								
				InRow.Cells(Кол).Select();
				WordApp.Application.Selection.InsertAfter(Знч);
				Кол = Кол + 1;
				
			КонецЦикла;	
			
			Если Н > 2 Тогда
				WordRows.Item(Н-1).Cells(3).Select();
				WordApp.Application.Selection.Copy();
				InRow.Cells(3).Select();
				WordApp.Application.Selection.PasteAndFormat(0);
			КонецЕсли;
			
			Н = Н + 1;
			
		КонецЦикла;                       
		
		NewDoc.Fields.Update();
		
		Версия = 1;
		
		ИмяСохраняемогоФайла = КаталогСохранения + ОбщиеДанные.ИмяФайла + " ver." + Строка(Версия) + ".docx";			
		
		ПроверяемыйФайл = Новый Файл(ИмяСохраняемогоФайла);
		Пока ПроверяемыйФайл.Существует() Цикл
			Версия = Версия + 1;
			ИмяСохраняемогоФайла = КаталогСохранения + ОбщиеДанные.ИмяФайла + " ver." + Строка(Версия) + ".docx";
			ПроверяемыйФайл = Новый Файл(ИмяСохраняемогоФайла);
		КонецЦикла;

		NewDoc.SaveAs(ИмяСохраняемогоФайла);	
		
		NewDoc.Close();
						
		ОбработкаПрерыванияПользователя();
		
		WordApp.Application.Quit();
				
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);	
		Отказ = Истина;
	КонецПопытки;
	
	// удалим файлы шаблона
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаШаблонаЗаявления);
	Исключение
	КонецПопытки;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(,"Формирование документов завершилось с ошибкой!");
	Иначе		
		ПоказатьПредупреждение(,"Формирование документов завершено!");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДанных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ТаблицаСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ТаблицаСчетовДУ.ОсновнойКодУБрокера КАК ОсновнойКодУБрокера,
	|	_ТаблицаСчетовДУ.КодСчетаДУ КАК КодСчетаДУ,
	|	_ТаблицаСчетовДУ.Флажок КАК Флажок
	|ПОМЕСТИТЬ _ТаблицаСчетовДУ
	|ИЗ
	|	&ТаблицаСчетовДУ КАК _ТаблицаСчетовДУ
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ТаблицаСчетовДУ.КодСчетаДУ КАК КодСчетаДУ,
	|	_ТаблицаСчетовДУ.СчетДоверительногоУправления.Наименование КАК НаименованиеСчетаДУ,
	|	_ТаблицаСчетовДУ.СчетДоверительногоУправления.Наименование КАК НаименованиеСчетаДУБезСкобок,
	|	_ТаблицаСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ТаблицаСчетовДУ.ОсновнойКодУБрокера КАК ОсновнойКодУБрокера,
	|	""Информация о ДУ "" + _ТаблицаСчетовДУ.КодСчетаДУ КАК ИмяФайла,
	|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора КАК НомерДоговораБрокерскогоОбслуживания,
	|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.ДатаЗаключения КАК ДатаЗаключенияДоговораБрокерскогоОбслуживания,
	|	"" "" КАК ИННЮрЛица,
	|	"" "" КАК РегистрационныйНомерНерезидента,
	|	"" "" КАК НомерДатаРегистрацииПравилПИФ,
	|	"" "" КАК ИННАИФ,
	|	ВЫБОР КОГДА _ТаблицаСчетовДУ.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица))
	| 		ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности
	|    ИНАЧЕ
	|	"" "" КОНЕЦ КАК СерияНомерПаспорта
	|ИЗ
	|	_ТаблицаСчетовДУ КАК _ТаблицаСчетовДУ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&ДатаЗаявления, Организация = &Организация И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
	|	ПО _ТаблицаСчетовДУ.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаЗаявления) КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(&ДатаЗаявления, Организация = &Организация) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
	|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо 
	|	ПО _ТаблицаСчетовДУ.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления 
	|ГДЕ 
	|	_ТаблицаСчетовДУ.Флажок
	|";
	
	ТаблицаСчетовДУ = СписокСчетовДУ.Выгрузить();
	ТаблицаСчетовДУ.Свернуть("Флажок, СчетДоверительногоУправления, ОсновнойБрокерскийДоговор, ОсновнойКодУБрокера, КодСчетаДУ");
	Запрос.УстановитьПараметр("ТаблицаСчетовДУ", ТаблицаСчетовДУ);
	Запрос.УстановитьПараметр("ДатаЗаявления", 	 Объект.ДатаЗаявления);
	Запрос.УстановитьПараметр("Организация", 	 Объект.Организация);
	Запрос.УстановитьПараметр("Брокер", 	 	 Объект.Брокер);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДанныеДляПечати = Новый Массив();
	
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл
		
		СтрокаДанных = Новый Структура();
		
		СтрокаДанных.Вставить("НомерСтроки", СокрЛП(НомерСтроки) + ".");
		НомерСтроки = НомерСтроки + 1;
		
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			СтрокаДанных.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
		
		СтрокаДанных.Вставить("НомерДатаСоглашенияОБрокерскомОбслуживании",
			Строка(СтрокаДанных.НомерДоговораБрокерскогоОбслуживания) + " от " + Формат(СтрокаДанных.ДатаЗаключенияДоговораБрокерскогоОбслуживания, "ДЛФ=DD"));
		
		ДанныеДляПечати.Добавить(СтрокаДанных);
		
	КонецЦикла;
		
	Возврат ДанныеДляПечати;  
	
КонецФункции

&НаСервере
Функция ПолучитьОбщиеРеквизитыДляПечати()
	
	РеквизитыОрганизации = Новый Структура("НаименованиеУК, ИННОрганизации, КППОрганизации, АдресОрганизации, ИмяФайла, КонтактноеЛицо, Основание, Должность");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеУК,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННОрганизации,
		|	РеквизитыЮридическихЛицСрезПоследних.КПП КАК КППОрганизации,
		|	КонтактнаяИнформацияСрезПоследних.Представление КАК АдресОрганизации,
		|	КонтактныеЛица.КонтактноеЛицо.Представление КАК КонтактноеЛицо,
		|	КонтактныеЛица.ОснованиеПолномочий КАК Основание,
		|	ЕСТЬNULL(КонтактныеЛица.Должность, """") КАК Должность
		|ИЗ
		|	Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				ЮрФизЛицо = &ЮрЛицо
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЮрФизЛица.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&Период,
		|				Объект = &ЮрЛицо
		|					И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК КонтактнаяИнформацияСрезПоследних
		|		ПО ЮрФизЛица.Ссылка = КонтактнаяИнформацияСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|		ПО ЮрФизЛица.Ссылка = КонтактныеЛица.Объект
		|			И (КонтактныеЛица.КонтактноеЛицо = &Подписант)
		|			И (КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|ГДЕ
		|	ЮрФизЛица.Ссылка = &ЮрЛицо";
	                       
	Запрос.УстановитьПараметр("Период", Объект.ДатаЗаявления);
	Запрос.УстановитьПараметр("ЮрЛицо", ЮрЛицоОрганизации);
	Запрос.УстановитьПараметр("Подписант", Объект.Подписант);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыОрганизации, Выборка);
	КонецЕсли;

	РеквизитыОрганизации.Вставить("НомерИнвестиционногоПортфеля", СокрЛП(СписокСчетовДУ[0].ОсновнойКодУБрокера));
	РеквизитыОрганизации.Вставить("ИмяФайла", "Заявление на открытие портфелей_" + РеквизитыОрганизации.НомерИнвестиционногоПортфеля + "_" +  Формат(Объект.ДатаЗаявления, "ДФ=dd.MM.yyyy"));
	РеквизитыОрганизации.Вставить("Дата", Формат(Объект.ДатаЗаявления, "ДЛФ=DD"));
	РеквизитыОрганизации.Вставить("Стратегия", ?(ЗначениеЗаполнено(Объект.Стратегия), "Cтратегия '" + СокрЛП(Объект.Стратегия) + "'", "Заменить"));
	РеквизитыОрганизации.Вставить("Подписант", РеквизитыОрганизации.Должность + " " + РеквизитыОрганизации.КонтактноеЛицо + ", на основании " + РеквизитыОрганизации.Основание);
	
	Возврат РеквизитыОрганизации;
	
КонецФункции // ПолучитьОбщиеРеквизитыДляПечати

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НазначитьКодыСчетовДУ(ПараметрыСессии = Неопределено)
	
	Для Каждого СтрокаСчетаДУ Из ЭтотОбъект.СписокСчетовДУ Цикл
		
		Если Не СтрокаСчетаДУ.Флажок Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаСчетаДУ.КодСчетаДУ) Тогда
			Продолжить;
		КонецЕсли;
				
		КодСчетаДУ = ОпределитьКодПортфеля(Объект.Организация, Объект.Брокер, СтрокаСчетаДУ.ОсновнойБрокерскийДоговор, СтрокаСчетаДУ.ОсновнойКодУБрокера); 
				
		НаборЗаписей = РегистрыСведений.КодыСчетовДоверительногоУправленияУБрокеров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
		НаборЗаписей.Отбор.СчетДоверительногоУправления.Установить(СтрокаСчетаДУ.СчетДоверительногоУправления);
		НаборЗаписей.Отбор.Брокер.Установить(Объект.Брокер);
		НаборЗаписей.Прочитать();
		
		ТаблицаЗаписей = НаборЗаписей.Выгрузить();
		Если НаборЗаписей.Количество() = 0 Тогда
			
			// Создаем новую запись о договоре
			НоваяЗапись = ТаблицаЗаписей.Добавить();
			НоваяЗапись.Организация 					= Объект.Организация;
			НоваяЗапись.СчетДоверительногоУправления 	= СтрокаСчетаДУ.СчетДоверительногоУправления;
			НоваяЗапись.Брокер 							= Объект.Брокер;
			НоваяЗапись.Код 							= КодСчетаДУ;
			НоваяЗапись.ДоговорБрокерскогоОбслуживания 	= СтрокаСчетаДУ.ОсновнойБрокерскийДоговор;
			НоваяЗапись.Период 							= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчетаДУ.СчетДоверительногоУправления, "ДатаЗаключения");
			
		Иначе
				
			ТаблицаЗаписей.Сортировать("Период УБЫВ");			
			ТаблицаЗаписей[0].Код = КодСчетаДУ;
			
		КонецЕсли;	
				
		НаборЗаписей.Загрузить(ТаблицаЗаписей);
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ДобавитьТекстОшибки(ПараметрыСессии, "Не записан код счета ДУ " + СокрЛП(СтрокаСчетаДУ.СчетДоверительногоУправления) + " " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не записан код счета ДУ " + СокрЛП(СтрокаСчетаДУ.СчетДоверительногоУправления) + " " + ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		СтрокаСчетаДУ.КодСчетаДУ = КодСчетаДУ;
		
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьКодыСчетовДУ(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаУстановитьКодыСчетовДУ");
	Попытка
		НазначитьКодыСчетовДУ(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура СтратегияПриИзменении(Элемент)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьКодПортфеля(Организация, Брокер, БрокерскийДоговор, КодИнвестСчета)
	
	// в соответствии с утвержденной схемой взаимодействия с брокером, мы сами нумеруем портфели;
	// портфели нумеруются последовательно в рамках инвест. счета через разделитель "_",
	// например: 2000_1, 2000_2, 2000_3,…
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Брокер = &Брокер
		|				И ДоговорБрокерскогоОбслуживания = &ДоговорБрокерскогоОбслуживания) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|ГДЕ
		|	ПОДСТРОКА(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код, 1, &ДлинаКодаИнвестСчета) = &КодИнвестСчета";
	
	Запрос.УстановитьПараметр("Организация",                    Организация);
	Запрос.УстановитьПараметр("Брокер",                         Брокер);
	Запрос.УстановитьПараметр("ДоговорБрокерскогоОбслуживания", БрокерскийДоговор);
	Запрос.УстановитьПараметр("КодИнвестСчета",                 КодИнвестСчета + "_");
	Запрос.УстановитьПараметр("ДлинаКодаИнвестСчета",           СтрДлина(КодИнвестСчета) + 1);
	
	КодыПортфелей = Запрос.Выполнить().Выгрузить();
	
	Если КодыПортфелей.Количество() = 0 Тогда
		Возврат КодИнвестСчета + "_1";
	КонецЕсли;
	
	// чтобы сортировка работала корректно, дополним коды портфелей спереди "0" до макс. длины
	МаксДлинаКодаПортфеля = 0;
	
	Для каждого СтрокаКодыПортфелей Из КодыПортфелей Цикл
		// первым проходом выделим коды портфелей и определим макс. длину
		СтрокаКодыПортфелей.Код = Сред(СтрокаКодыПортфелей.Код, Запрос.Параметры.ДлинаКодаИнвестСчета + 1);
		
		Если Макс(МаксДлинаКодаПортфеля) < СтрДлина(СтрокаКодыПортфелей.Код) Тогда
			МаксДлинаКодаПортфеля = СтрДлина(СтрокаКодыПортфелей.Код);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаКодыПортфелей Из КодыПортфелей Цикл
		// вторым проходом дополним коды портфелей лид. нулями, чтобы подготовить к сортировке
		Пока СтрДлина(СтрокаКодыПортфелей.Код) < МаксДлинаКодаПортфеля Цикл
			СтрокаКодыПортфелей.Код = "0" + СтрокаКодыПортфелей.Код;
		КонецЦикла;
	КонецЦикла;
	
	КодыПортфелей.Сортировать("Код УБЫВ");
	
	Возврат КодИнвестСчета + "_" + Строка(Число(КодыПортфелей[0].Код) + 1);
	
КонецФункции // ОпределитьКодПортфеля

&НаКлиенте
Процедура КаталогСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Объект.КаталогСохранения; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Объект.КаталогСохранения = Диалог.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КаталогСохраненияОткрытие(Элемент, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.КаталогСохранения + "\");

КонецПроцедуры

&НаКлиенте
Процедура СписокСчетовДУСчетДоверительногоУправленияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СписокСчетовДУ.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.СчетДоверительногоУправления = ПредопределенноеЗначение("Справочник.СчетаДоверительногоУправления.ПустаяСсылка") Тогда
		
		ТекущаяСтрока.Флажок 					= Ложь;
		ТекущаяСтрока.КодСчетаДУ 				= "";
		ТекущаяСтрока.ВводДенежныхСредств 		= "";
		ТекущаяСтрока.ОсновнойБрокерскийДоговор = "";
		ТекущаяСтрока.ОсновнойКодУБрокера 		= Ложь;
		
	Иначе
		
		// Запомним ввод ДС. Если счет ДУ не изменен, ввод ДС не будем очищать
		ВводДС = ТекущаяСтрока.ВводДенежныхСредств;
		СчетДУ = "";
		Если ЗначениеЗаполнено(ВводДС) Тогда
			СчетДУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВводДС, "СчетДоверительногоУправления");
		КонецЕсли;	
			
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ПолучитьДанныеСчетаДУ(Объект.Организация, ТекущаяСтрока.СчетДоверительногоУправления, Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания));
		
		Если СчетДУ = ТекущаяСтрока.СчетДоверительногоУправления Тогда
			ТекущаяСтрока.ВводДенежныхСредств = ВводДС;
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСчетаДУ(Организация, СчетДоверительногоУправления, НачалоПериода, НаДату)
	
	СтруктураРезультата = Новый Структура("Флажок, СчетДоверительногоУправления, Стратегия, КодСчетаДУ, ОсновнойБрокерскийДоговор, ОсновнойКодУБрокера, ВводДенежныхСредств");
	Запрос = Новый Запрос;
		
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("НачалоПериода",					НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",					КонецДня(НаДату));
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		| 	ИСТИНА КАК Флажок,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия, ЗНАЧЕНИЕ(Справочник.СтратегииИндивидуальногоИнвестирования.ПустаяСсылка)) КАК Стратегия,
		|	ЕСТЬNULL(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код, """") КАК КодСчетаДУ,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокер КАК ОсновнойБрокер,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокерскийДоговор КАК ОсновнойБрокерскийДоговор,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойКодУБрокера КАК ОсновнойКодУБрокера,
		|	ЗНАЧЕНИЕ(Документ.ВводДенежныхСредств.ПустаяСсылка) КАК ВводДенежныхСредств
		|ИЗ
		|	РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(
		|			&КонецПериода,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&КонецПериода, ) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО СтратегииИндивидуальногоИнвестированияСрезПоследних.Организация = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация
		|			И СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления";
		
	Выборка= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		СтруктураРезультата.Вставить("Флажок", 						 	Выборка.Флажок);
		СтруктураРезультата.Вставить("СчетДоверительногоУправления", 	Выборка.СчетДоверительногоУправления);
		СтруктураРезультата.Вставить("Стратегия", 						Выборка.Стратегия);
		СтруктураРезультата.Вставить("КодСчетаДУ", 						Выборка.КодСчетаДУ);
		СтруктураРезультата.Вставить("ОсновнойБрокерскийДоговор", 		Выборка.ОсновнойБрокерскийДоговор);
		СтруктураРезультата.Вставить("ОсновнойКодУБрокера", 			Выборка.ОсновнойКодУБрокера);
		СтруктураРезультата.Вставить("ВводДенежныхСредств", 			Выборка.ВводДенежныхСредств);
				
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции // ПолучитьДанныеСчетаДУ

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Объект.Организация, Объект.Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ПодписантДолжность = СтруктураДанныхКонтактногоЛица.Должность;
	ВыбранноеЗначение  = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
		
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
